[
    {"word": "wreath", "sentence": "She placed a beautiful wreath on the door for Christmas."},
    {"word": "known", "sentence": "The doctor was not known to the patient."},
    {"word": "knowledge", "sentence": "Her knowledge of ancient history was impressive."},
    {"word": "written", "sentence": "The instructions were written clearly on the board."},
    {"word": "wrapper", "sentence": "He carefully removed the wrapper from the chocolate."},
    {"word": "arrow", "sentence": "The arrow flew straight to the target."},
    {"word": "correct", "sentence": "You need to correct the mistakes in your paper."},
    {"word": "mirror", "sentence": "She looked at herself in the mirror before leaving."},
    {"word": "surround", "sentence": "The house was surrounded by beautiful trees."},
    {"word": "knead", "sentence": "She began to knead the dough for the bread."},
    {"word": "knotted", "sentence": "The rope was knotted tightly, making it hard to untie."},
    {"word": "resign", "sentence": "He had to resign from his position due to health issues."},
    {"word": "designed", "sentence": "The new phone was designed with the latest technology."},
    {"word": "assign", "sentence": "The teacher will assign the homework at the end of the class."},
    {"word": "wrinkled", "sentence": "His shirt was wrinkled after being in the suitcase for so long."},
    {"word": "foreign", "sentence": "She felt nervous speaking in a foreign language."},
    {"word": "wrestler", "sentence": "The wrestler won the championship match by pinning his opponent."},
    {"word": "campaign", "sentence": "The political campaign was gaining momentum as election day approached."},
    {"word": "cologne", "sentence": "He wore a fresh, floral cologne that lingered in the air."},
    {"word": "knuckles", "sentence": "He cracked his knuckles before getting ready to work."},
    {"word": "align", "sentence": "The shelves were not properly aligned with the wall."},
    {"word": "errand", "sentence": "I need to run a quick errand before we meet for lunch."}
]